examples/dfLowMachFoam/oneD_freelyPropagation/CH4/torchSolver/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object       T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar>
4335
(
300.000000000000000
299.999999900195405
299.999999801082481
299.999999702659579
299.999999604925108
299.999999507877533
299.999999411515148
299.999999315836419
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 300.00000000;
    }
    outlet
    {
        type            zeroGradient;
    }
    wall
    {
        type            empty;
    }
}


// ************************************************************************* //
